testsrc/main/mondrian/xmla/error/Discovery04.xml

<?xml version="1.0"?>
<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
  <Header>
    <Foo>Have a nice day</Foo>
  </Header>
  <Body>
    <Discover xmlns="urn:schemas-microsoft-com:xml-analysis">
      <RequestType>DISCOVER_DATASOURCES</RequestType>
      <Restrictions>
        <RestrictionList/>
        <RestrictionList/>
      </Restrictions>
      <Properties>
        <PropertyList>
          <Content>Data</Content>
        </PropertyList>
      </Properties>
    </Discover>
  </Body>
</Envelope>
